#親階層
##レディース
# if !Category.find_by_id(1)
  parents = ["レディース", "メンズ", "ベビー・キッズ", "インテリア・住まい・小物", "本・音楽・ゲーム", "おもちゃ・ホビー・グッズ", "コスメ・香水・美容", "家電・スマホ・カメラ", "スポーツ・レジャー", "ハンドメイド", "チケット", "自動車・オートバイ", "その他"]  
  children = 
  [
    ['トップス','ジャケット/アウター','パンツ','スカート','ワンピース','靴','ルームウェア/パジャマ','レッグウェア','帽子','バッグ','アクセサリー','ヘアアクセサリー','小物','時計','ウィッグ/エクステ','浴衣/水着','スーツ/フォーマル/ドレス','マタニティ','その他'],
    ['トップス','ジャケット/アウター','パンツ','靴','バッグ','スーツ','帽子','アクセサリー','小物','時計','水着','レッグウェア','アンダーウェア','その他'],
    ['ベビー服(女の子用)~95cm','ベビー服(男の子用)~95cm','ベビー服(男女兼用)~95cm','ベビー服(女の子用)100cm~','ベビー服(男の子用)100cm~','ベビー服(男女兼用)100cm~','キッズ靴','子ども用ファッション小物','おむつ/トイレ/バス','外出/移動用品','授乳/食事','ベビー家具/寝具/室内用品','おもちゃ','行事/記念品','その他'],
    ['キッチン/食器','ベッド/マットレス','ソファ/ソファベッド','椅子/チェア','机/テーブル','収納家具','ラグ/カーペット/マット','カーテン/ブラインド','ライト/照明','寝具','インテリア小物','季節/年中行事','その他'],
    ['本','漫画','雑誌','CD','DVD/ブルーレイ','レコード','テレビゲーム'],
    ['おもちゃ','タレントグッズ','コミック/アニメグッズ','トレーディングカード','フィギュア','楽器/器材','コレクション','ミリタリー','美術品','アート品','その他'],
    ['ベースメイク','メイクアップ','ネイルケア','香水','スキンケア/基礎化粧品','ヘアケア','ボディケア','オーラルケア','リラクゼーション','ダイエット','その他'],
    ['スマートフォン/携帯電話','スマホアクセサリー','PC/タブレット','カメラ','テレビ/映像機器','オーディオ機器','美容/健康','冷暖房/空調','生活家電','その他'],
    ['ゴルフ','フィッシング','自転車','トレーニング/エクササイズ','野球','サッカー/フットサル','テニス','スノーボード','スキー','その他スポーツ','アウトドア','その他'],
    ['アクセサリー(女性用)','ファッション/小物','アクセサリー/時計','日用品/インテリア','趣味/おもちゃ','キッズ/ベビー','素材/材料','二次創作物','その他'],
    ['音楽','スポーツ','演劇/芸能','イベント','映画','施設利用券','優待券/割引券','その他'],
    ['自動車本体','自動車タイヤ/ホイール','自動車パーツ','自動車アクセサリー','オートバイ車体','オートバイパーツ','オートバイアクセサリー','その他'],
    ['まとめ売り','ペット用品','食品','飲料/酒','日用品/生活雑貨/旅行','アンティーク/コレクション','文房具/事務用品','事務/店舗用品','その他'],
  ]
  grand_children = 
  [
    # レディース
    ['Tシャツ/カットソー(半袖/袖なし)','Tシャツ/カットソー(七分/長袖)','シャツ/ブラウス(半袖/袖なし)','シャツ/ブラウス(七分/長袖)','ポロシャツ','キャミソール','タンクトップ','ホルターネック','ニット/セーター','チュニック','カーディガン/ボレロ','アンサンブル','ベスト/ジレ','パーカー','トレーナー/スウェット','ベアトップ/チューブトップ','ジャージ','その他'],
    ['テーラードジャケット','ノーカラージャケット','Gジャン/デニムジャケット','レザージャケット','ダウンジャケット','ライダースジャケット','ミリタリージャケット','ダウンベスト','ジャンパー/ブルゾン','ポンチョ','ロングコート','トレンチコート','ダッフルコート','ピーコート','チェスターコート','モッズコート','スタジャン','毛皮/ファーコート','スプリングコート','スカジャン','その他'],
    ['デニム/ジーンズ','ショートパンツ','カジュアルパンツ','ハーフパンツ','チノパン','ワークパンツ/カーゴパンツ','クロップドパンツ','サロペット/オーバーオール','オールインワン','サルエルパンツ','ガウチョパンツ','その他'],
    ['ミニスカート','ひざ丈スカート','ロングスカート','キュロット','その他'],
    ['ミニワンピース','ひざ丈ワンピース','ロングワンピース','その他'],
    ['ハイヒール/パンプス','ブーツ','サンダル','スニーカー','ミュール','モカシン','ローファー/革靴','フラットシューズ/バレエシューズ','長靴/レインシューズ','その他'],
    ['パジャマ','ルームウェア'],
    ['ソックス','スパッツ/レギンス','ストッキング/タイツ','レッグウォーマー','その他'],
    ['ニットキャップ/ビーニー','ハット','ハンチング/ベレー帽','キャップ','キャスケット','麦わら帽子','その他'],
    ['ハンドバッグ','トートバッグ','エコバッグ','リュック/バックパック','ボストンバッグ','スポーツバッグ','ショルダーバッグ','クラッチバッグ','ポーチ/バニティ','ボディバッグ/ウェストバッグ','マザーズバッグ','メッセンジャーバッグ','ビジネスバッグ','旅行用バッグ/キャリーバッグ', 'ショップ袋', '和装用バッグ', 'かごバッグ', 'その他'],
    ['ネックレス','ブレスレット','バングル/リストバンド','リング','ピアス(片耳用)','ピアス(両耳用)','イヤリング','アンクレット','ブローチ/コサージュ','チャーム','その他'],
    ['ヘアゴム/シュシュ','ヘアバンド/カチューシャ','ヘアピン','その他'],
    ['長財布','折り財布','コインケース/小銭入れ','名刺入れ/定期入れ','キーケース','キーホルダー','手袋/アームカバー','ハンカチ','ベルト','マフラー/ショール','ストール/スヌード','バンダナ/スカーフ','ネックウォーマー','サスペンダー','サングラス/メガネ','モバイルケース/カバー','手帳','イヤマフラー','傘', 'レインコート/ポンチョ','ミラー','タバコグッズ','その他'],
    ['腕時計(アナログ)','腕時計(デジタル)','ラバーベルト','レザーベルト','金属ベルト','その他'],
    ['前髪ウィッグ','ロングストレート','ロングカール','ショートストレート','ショートカール','その他'],
    ['浴衣','着物','振袖','長襦袢/半襦袢','水着セパレート','水着ワンピース','水着スポーツ用','その他'],
    ['スカートスーツ上下','パンツスーツ上下','ドレス','パーティーバッグ','シューズ','ウェディング','その他'],
    ['トップス','アウター','インナー','ワンピース','パンツ/スパッツ','スカート','パジャマ','授乳服','その他'],
    ['コスプレ','下着','その他'],
    # メンズ
    ['Tシャツ/カットソー(半袖/袖なし)','Tシャツ/カットソー(七分/長袖)','シャツ','ポロシャツ','タンクトップ','ニット/セーター','パーカー','カーディガン','スウェット','ジャージ','ベスト','その他'],
    ['テーラードジャケット','ノーカラージャケット','Gジャン/デニムジャケット','レザージャケット','ダウンジャケット','ライダースジャケット','ミリタリージャケット','ナイロンジャケット','フライトジャケット','ダッフル','ピーコート','ステンカラーコート','トレンチコート','モッズコート','チェスターコート','スタジャン','スカジャン','ブルゾン','マウンテンパーカー','ダウンベスト','ポンチョ','カバーオール','その他'],
    ['デニム/ジーンズ','ワークパンツ/カーゴパンツ','スラックス','チノパン','ショートパンツ','ペインダーパンツ','サルエルパンツ','オーバーオール','ポーチ/バニティ','ボディバッグ/ウェストバッグ','マザーズバッグ','メッセンジャーバッグ','ビジネスバッグ','旅行用バッグ/キャリーバッグ','その他'],
    ['スニーカー','サンダル','ブーツ','モカシン','ドレス/ビジネス','長靴/レインシューズ','デッキシューズ','その他'],
    ['ショルダーバッグ','トートバッグ','ボストンバッグ','リュック/バックパック','ウエストポーチ','ボディーバッグ','ドラムバッグ','ビジネスバッグ','トラベルバッグ','メッセンジャーバッグ','エコバッグ','その他'],
    ['スーツジャケット','スーツベスト','スラックス','セットアップ','その他'],
    ['キャップ','ハット','ニットキャップ/ビーニー','ハンチング/ベレー帽','キャスケット','サンバイザー','その他'],
    ['ネックレス','ブレスレット','バングル/リストバンド','リング','ピアス(片耳用)','ピアス(両耳用)','アンクレット','その他'],
    ['長財布','折り財布','マネークリップ','コインケース/小銭入れ','名刺入れ/定期入れ','キーケース','キーホルダー','ネクタイ','手袋','ハンカチ','ベルト','マフラー','ストール','バンダナ','ネックウォーマー','サスペンダー','ウォレットチェーン','サングラス/メガネ','モバイルケース/カバー','手帳','ストラップ','ネクタイピン','カフリンクス','イヤマフラー','傘','レインコート','ミラー','タバコグッズ','その他'],
    ['腕時計(アナログ)','腕時計(デジタル)','ラバーベルト','レザーベルト','金属ベルト','その他'],
    ['一般水着','スポーツ用','アクセサリー','その他'],
    ['ソックス','レギンス/スパッツ','レッグウォーマー','その他'],
    ['トランクス','ボクサーパンツ','その他'],
    ['その他'],
    # ベビーキッズ
    ['トップス','アウター','パンツ','スカート','ワンピース','ベビードレス','おくるみ','下着/肌着','パジャマ','ロンパース','その他'],
    ['トップス','アウター','パンツ','おくるみ','下着/肌着','パジャマ','ロンパース','その他'],
    ['トップス','アウター','パンツ','おくるみ','下着/肌着','パジャマ','ロンパース','その他'],
    ['コート','ジャケット/上着','トップス(Tシャツ/カットソー)','トップス(トレーナー)','トップス(チュニック)','トップス(タンクトップ)','トップス(その他)','スカート','パンツ','ワンピース','セットアップ','パジャマ','フォーマル/ドレス','和服','浴衣','甚平','水着','その他'],
    ['コート','ジャケット/上着','トップス(Tシャツ/カットソー)','トップス(トレーナー)','トップス(その他)','パンツ','セットアップ','パジャマ','フォーマル/ドレス','和服','浴衣','甚平','水着','その他'],
    ['コート','ジャケット/上着','トップス(Tシャツ/カットソー)','トップス(トレーナー)','トップス(その他)','ボトムス','パジャマ','その他'],
    ['スニーカー','サンダル','ブーツ','長靴','その他'],
    ['靴下/スパッツ','帽子','エプロン','サスペンダー','タイツ','ハンカチ','バンダナ','ベルト','マフラー','傘','手袋','スタイ','バッグ','その他'],
    ['おむつ用品','おまる/補助便座','トレーニングパンツ','ベビーバス','お風呂用品','その他'],
    ['ベビーカー','抱っこひも/スリング','チャイルドシート','その他'],
    ['ミルク','ベビーフード','ベビー用食器','その他'],
    ['ベッド','布団/毛布','イス','たんす','その他'],
    ['おふろのおもちゃ','がらがら','オルゴール','ベビージム','手押し車/カタカタ','知育玩具','その他'],
    ['お宮参り用品','お食い初め用品','アルバム','手形/足形','その他'],
    ['その他'],
    # インテリア・住まい・小物
    ['食器','調理器具','収納/キッチン雑貨','弁当用品','カトラリー(スプーン等)','テーブル用品','容器','エプロン','アルコールグッズ','浄水機','その他'],
    ['セミシングルベッド','シングルベッド','セミダブルベッド','ダブルベッド','ワイドダブルベッド','クイーンベッド','キングベッド','脚付きマットレスベッド','マットレス','すのこベッド','ロフトベッド/システムベッド','簡易ベッド/折りたたみベッド','収納つき','その他'],
    ['ソファベッド','シングルソファ','ラブソファ','トリプルソファ','オットマン','コーナーソファ','ビーズソファ/クッションソファ','ローソファ/フロアソファ','ソファベッド','応接ベッド','ソファカバー','リクライニングソファ','その他'],
    ['一般','スツール','ダイニングチェア','ハイバッグチェア','ロッキングチェア','座椅子','折り畳みイス','デスクチェア','その他'],
    ['こたつ','カウンターテーブル','サイドテーブル','センターテーブル','ダイニングテーブル','座卓/ちゃぶ台','アウトドア用品','パソコン用','事務机/学習机','その他'],
    ['リビング収納','キッチン収納','玄関/屋外収納','バス/トイレ収納','本収納','本/CD/DVD収納','洋服タンス/押入れ収納','電話台/ファックス台','ドレッサー/鏡台','棚/ラック','ケース/ボックス','その他'],
    ['ラグ','カーペット','ホットカーペット','玄関/キッチンマット','トイレ/バスマット','その他'],
    ['カーテン','ブラインド','ロールスクリーン','のれん','その他'],
    ['蛍光灯/電球','天井照明','フロアスタンド','その他'],
    ['布団/毛布','枕','シーツ/カバー','その他'],
    ['ゴミ箱','ウェルカムボード','オルゴール','クッション','クッションカバー','スリッパラック','ティッシュボックス','バスケット/かご','フォトフレーム','マガジンラック','モビール','花瓶','灰皿','傘立て','小物入れ','置時計','掛時計/柱時計','鏡(立て掛け式)','鏡(壁掛け式)','置物','風鈴','植物/観葉植物','その他'],
    ['正月','成人式','バレンタインデー','ひな祭り','子どもの日','母の日','父の日','サマーギフト/お中元','夏/夏休み','ハロウィン','敬老の日','七五三','お歳暮','クリスマス','冬一般','その他'],
    ['その他'],
    # 本・音楽・ゲーム
    ['文学/小説','人文/社会','ノンフィクション/教養','地図/旅行ガイド','ビジネス/経済','健康/医学','コンピュータ/IT','趣味/スポーツ/実用','住まい/暮らし/子育て','アート/エンタメ','洋書','絵本','参考書','その他'],
    ['全巻セット','少年漫画','少女漫画','青年漫画','女性漫画','同人誌','その他'],
    ['アート/エンタメ/ホビー','ファッション','ニュース/総合','趣味/スポーツ','その他'],
    ['邦楽','洋楽','アニメ','クラシック','K-POP/アジア','キッズ/ファミリー','その他'],
    ['外国映画','日本映画','アニメ','TVドラマ','ミュージック','お笑い/バラエティ','スポーツ/フィットネス','キッズ/ファミリー','その他'],
    ['邦楽','洋楽','その他'],
    ['家庭用ゲーム本体','家庭用ゲームソフト','携帯用ゲーム本体','携帯用ゲームソフト','PCゲーム','その他'],
    # おもちゃ・ホビー・グッズ
    ['キャラクターグッズ','ぬいぐるみ','小物/アクセサリー','模型/プラモデル','ミニカー','トイラジコン','プラモデル','ホビーラジコン','鉄道模型','その他'],
    ['アイドル','ミュージシャン','タレント/お笑い芸人','スポーツ選手','その他'],
    ['ストラップ','キーホルダー','バッジ','カード','クリアファイル','ポスター','タオル','その他'],
    ['遊戯王','マジック：座・ギャザリング','ポケモンカードゲーム','デュエルマスターズ','バトルスピリッツ','アイカツ','カードファイト！！ヴァンガード','ヴァイスシュヴァルツ','プロ野球オーナーズリーグ','ベースボールヒーローズ','ドラゴンボール','スリープ','その他'],
    ['コミック/アニメ','特撮','ゲームキャラクター','SF/ファンタジー/ホラー','アメコミ','スポーツ','ミリタリー','その他'],
    ['エレキギター','アコースティックギター','ベース','エフェクター','バトルスピリッツ','アイカツ','カードファイト！！ヴァンガード','ヴァイスシュヴァルツ','プロ野球オーナーズリーグ','ベースボールヒーローズ','ドラゴンボール','スリープ','その他'],
    ['武具','使用済切手/官製はがき','旧貨幣/金貨/銀貨/記念硬貨','印刷物','ノベルディグッズ','その他'],
    ['トイガン','個人装備','その他'],
    ['陶芸','ガラス','漆芸','金属工芸','絵画/タペストリ','版画','彫刻/オブジェクト','書','写真','その他'],
    ['画材','額縁','その他'],
    ['トランプ/UNO','カルタ/百人一首','ダーツ','ビリヤード','麻雀','パズル/ジグソーパズル','囲碁/将棋','オセロ/チェス','人生ゲーム','野球/サッカーゲーム','スポーツ','三輪車/乗り物','ヨーヨー','模型制作用品','鉄道','航空機','アマチュア無線','パチンコ/パチスロ','その他'],
    # コスメ・香水・美容 
    ['ファンデーション','化粧下地','コントロールカラー','BBクリーム','CCクリーム','コンシーラー','フェイスパウダー','トライアルセット/サンプル','その他'],
    ['アイシャドウ','口紅','リップグロス','リップライナー','チーク','フェイスカラー','マスカラ','アイライナー','つけまつげ','アイブロウペンシル','パウダーアイブロウ','眉マスカラ','トライアルセット/サンプル','メイク道具/化粧小物','美顔用品/美顔ローラー','その他'],
    ['ネイルカラー','カラージェル','ネイルベースコート/トップコート','ネイルアート用品','ネイルパーツ','ネイルチップ/付け爪','手入れ用品','除光液','その他'],
    ['香水(女性用)','香水(男性用)','ユニセックス','ボディミスト','その他'],
    ['化粧水/ローション','乳液/ミルク','美容液','フェイスクリーム','洗顔料','クレンジング/メイク落とし','パック/フェイスマスク','ジェル/ゲル','ブースター/導入液','アイケア','リップケア','トライアルセット/サンプル','洗顔グッズ','その他'],
    ['シャンプー','トリートメント','コンディショナー','リンス','スタイリング剤','カラーリング剤','ブラシ','その他'],
    ['オイル/クリーム','ハンドクリーム','ローション','日焼け止め/サンオイル','ボディソープ','入浴剤','制汗/デオドラント','フットケア','その他'],
    ['口臭防止/エチケット用品','歯ブラシ','その他'],
    ['エッセンシャルオイル','芳香器','お香/香炉','キャンドル','リラクゼーショングッズ','その他'],
    ['ダイエット食品','エクササイズ用品','体重計','体脂肪率','その他'],
    ['健康用品','看護/介護用品','救急/衛生用品','その他'],
    # 家電・スマホ・カメラ
    ['スマートフォン本体','バッテリー/充電器','携帯電話本体','PHS本体','その他'],
    ['Android用ケース','iPhone用ケース','カバー','イヤホンジャック','ストラップ','フィルム','自撮り棒','その他'],
    ['タブレット','ノートPC','デスクトップ型PC','ディスプレイ','電子ブックリーダー','PC周辺機器','PCパーツ','その他'],
    ['デジタルカメラ','ビデオカメラ','レンズ(単焦点)','レンズ(ズーム)','フィルムカメラ','防犯カメラ','その他'],
    ['テレビ','プロジェクター','ブルーレイレコーダー','DVDレコーダー','ブルーレイプレーヤー','DVDプレーヤー','映像用ケーブル','その他'],
    ['ポータルプレーヤー','イヤフォン','ヘッドフォン','アンプ','スピーカー','ケーブル/シールド','ラジオ','その他'],
    ['ヘアドライヤー','ヘアアイロン','美容機器','電気シェーバー','電動歯ブラシ','その他'],
    ['エアコン','空気清浄機','加湿器','扇風機','除湿機','ファンヒーター','電気ヒーター','オイルヒーター','ストーブ','ホットカーペット','こたつ','電気毛布','その他'],
    ['冷蔵庫','洗濯機','炊飯器','電子レンジ/オーブン','調理機器','アイロン','掃除機','エスプレッソマシン','コーヒーメーカー','衣類乾燥機','その他'],
    ['その他'],
    # スポーツ・レジャー
    ['クラブ','ウエア(男性用)','ウエア(女性用)','バッグ','シューズ(男性用)','シューズ(女性用)','アクセサリー','その他'],
    ['ロッド','リール','ルアー用品','ウエア','釣り糸/ライン','その他'],
    ['自転車本体','ウエア','パーツ','アクセサリー','バッグ','工具/メンテナンス','その他'],
    ['ランニング','ウォーキング','ヨガ','トレーニング用品','その他'],
    ['ウェア','シューズ','グローブ','バット','アクセサリー','防具','練習機能','記念グッズ','応援グッズ','その他'],
    ['ウェア','シューズ','ボール','アクセサリー','記念グッズ','応援グッズ','その他'],
    ['ラケット(硬式用)','ラケット(軟式用)','ウェア','シューズ','ボール','アクセサリー','記念グッズ','応援グッズ','その他'],
    ['ボード','バインディング','ブーツ(男性用)','ブーツ(女性用)','ブーツ(子供用)','ウエア/装備(男性用)','ウエア/装備(女性用)','ウエア/装備(子供用)','アクセサリー','バッグ','その他'],
    ['板','ブーツ(男性用)','ブーツ(女性用)','ブーツ(子供用)','ビンディング','ウエア(男性用)','ウエア(女性用)','ウエア(子供用)','ストック','その他'],
    ['ダンス/バレエ','サーフィン','バスケットボール','バトミントン','バレーボール','スケートボード','陸上競技','ラグビー','アメリカンフットボール','ボクシング','ボウリング','その他'],
    ['テント/タープ','ライト/ランタン','寝袋/寝具','テーブル/チェア','ストーブ/コンロ','調理器具','食器','登山用品','その他'],
    ['旅行用品','その他'],
    # ハンドメイド
    ['ピアス','イヤリング','ネックレス','ブレスレット','リング','チャーム','ヘアゴム','アンクレット','その他'],
    ['バッグ(女性用)','バッグ(男性用)','財布(女性用)','財布(男性用)','ファッション雑貨','その他'],
    ['アクセサリー(男性用)','時計(女性用)','時計(男性用)','その他'],
    ['キッチン用品','家具','文房具','アート/写真','アロマ/キャンドル','フラワー/ガーデン','その他'],
    ['クラフト/布製品','おもちゃ/人形','その他'],
    ['ファッション雑貨','スタイ/よだれかけ','外出用品','ネームタグ','その他'],
    ['各種パーツ','生地/糸','型紙/パターン','その他'],
    ['Ingress','クリエイターズ宇宙兄弟'],
    ['その他'],
    # チケット
    ['男性アイドル','女性アイドル','韓流','国内アーティスト','海外アーティスト','音楽フェス','声優/アニメ','その他'],
    ['サッカー','野球','テニス','格闘技/プロレス','相撲/武道','ゴルフ','ボレーボール','バスケットボール','モータースポーツ','ウィンタースポーツ','その他'],
    ['ミュージカル','演劇','伝統芸能','落語','お笑い','オペラ','サーカス','バレエ','その他'],
    ['声優/アニメ','キッズ/ファミリー','トークショー/講演会','その他'],
    ['邦画','洋画','その他'],
    ['遊園地/テーマパーク','美術館/博物館','スキー場','ゴルフ場','フィットネスクラブ','プール','ボウリング場','水族館','動物園','その他'],
    ['ショッピング','レストラン/食事券','フード/ドリンク券','宿泊券','その他'],
    ['その他'],
    # 自動車・オートバイ
    ['国内自動車本体','外国自動車本体'],
    ['タイヤ/ホイールセット','タイヤ','ホイール','その他'],
    ['サスペンション','ブレーキ','外装、エアロパーツ','ライト','内装品、シート','ステアリング','マフラー・排気系','エンジン、過給機、冷却装置','クラッチ、ミッション、駆動系','電装品','補強パーツ','汎用パーツ','外国自動車用パーツ','その他'],
    ['車内アクセサリー','カーナビ','カーオーディオ','車外アクセサリー','メンテナンス用品','チャイルドシート','ドライブレコーダー','レーダー探知機','カタログ/マニュアル','セキュリティ','ETC','その他'],
    ['その他'],
    ['タイヤ','マフラー','エンジン、冷却装置','カウル、フェンダー、外装','サスペンション','ホイール','シート','ブレーキ','タンク','ライト、ウィンカー','チェーン、スプロケット、駆動系','メーター','電装系','ミラー','外国オートバイ用パーツ','その他'],
    ['ヘルメット/シールド','バイクウエア/装備','アクセサリー','メンテナンス','カタログ/マニュアル','その他'],
    ['その他'],
    # その他
    ['まとめ売り'],
    ['ペットフード','犬用品','猫用品','魚用品/水草','小動物用品','爬虫類/両生類用品','かご/おり','鳥用品','虫類用品','その他'],
    ['菓子','米','野菜','果物','調味料','魚介類(加工食品)','肉類(加工食品)','その他 加工食品','その他'],
    ['コーヒー','ソフトドリンク','ミネラルウォーター','茶','ウイスキー','ワイン','ブランデー','焼酎','日本酒','ビール、発泡酒','その他'],
    ['タオル/バス用品','日用品/生活雑貨','洗剤/柔軟剤','旅行用品','防災関連グッズ','その他'],
    ['雑貨','工芸品','家具','印刷物','その他'],
    ['筆記用具','ノート/メモ帳','テープ/マスキングテープ','カレンダー/スケジュール','アルバム/スクラップ','ファイル/バインダー','はさみ/カッター','カードホルダー/名刺管理','のり/ホッチキス','その他'],
    ['オフィス用品一般','オフィス家具','店舗用品','OA機器','ラッピング/包装','その他'],
    ['その他'],
  ]
  #親カテゴリの登録
  parents.each do |parent| 
    Category.create(name: parent)
  end

  @parents = Category.where(ancestry: nil)

    #子カテゴリの登録
  c = 0
  @parents.each do |parent|
    children[c].each do |child|
      parent.children.create(name: child)
    end
    c += 1
  end
    #孫カテゴリの登録
  g =0
  @parents.each do |parent|
    index = parent.id  

    @children = Category.where(ancestry: index)

      @children.each do |child|   
        grand_children[g].each do |grand_child|
          child.children.create(name: grand_child)
      end
      g += 1
    end
  end
# end
# end
if !User.find_by_id(1)
  user = User.new(last_name: '山田',first_name: '太朗', last_name_kana: 'ヤマダ', first_name_kana: 'タロウ',
  birthday: '2020-01-01', nickname: 'ヤマタロー', tell: '11111111',
  email: 'yamada_taro@japan.com', password: '00000000', password_confirmation: '00000000')
  user.save!
  user = User.new(last_name: '田中',first_name: '二郎', last_name_kana: 'タナカ', first_name_kana: 'ジロウ',
    birthday: '2020-01-01', nickname: 'タナジロー', tell: '22222222',
    email: 'tanaka_jiro@japan.com', password: '1111111', password_confirmation: '1111111')
  user.save!
end

if !Product.find_by_id(1)
  image = File.open("#{Rails.root}/spec/images/test1.jpg")
  product = Product.create(name: "apple",price: 1000,explanation: "これはりんごです",quality_id: 1,
    shipping_charge_id: 1,delivery_date_id: 1,trading_status: "出品中",area_id: 1,user_id: 1, category_id: 3, 
    images_attributes: [image: image])
  product = Product.create(name: "orange",price: 1000,explanation: "これはオレンジです",quality_id: 1,
    shipping_charge_id: 1,delivery_date_id: 1,trading_status: "出品中",area_id: 1,user_id: 1, category_id: 3, 
    images_attributes: [image: image])
  product = Product.create(name: "greap",price: 1000,explanation: "これはぶどうです",quality_id: 1,
    shipping_charge_id: 1,delivery_date_id: 1,trading_status: "出品中",area_id: 1,user_id: 1, category_id: 3, 
    images_attributes: [image: image])
  product = Product.create(name: "iphone",price: 1000,explanation: "これはipnoneです",quality_id: 1,
    shipping_charge_id: 1,delivery_date_id: 1,trading_status: "出品中",area_id: 1,user_id: 2, category_id: 3, 
    images_attributes: [image: image])
  product = Product.create(name: "galaxy",price: 1000,explanation: "これはgalaxyです",quality_id: 1,
    shipping_charge_id: 1,delivery_date_id: 1,trading_status: "出品中",area_id: 1,user_id: 2, category_id: 3, 
    images_attributes: [image: image])

end
